# DetailElementOrderUtils Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DetailElementOrderUtils Methods
DetailElementOrderUtils Class See Also
---
The DetailElementOrderUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreDetailElements | Indicates if the elements are all detail elements that participate in detail draw ordering in the view. |
| BringForward(Document, View, ElementId) | Moves the given detail instance one step closer to the front of all other detail instances in the view. |
| BringForward(Document, View, ICollection<(Of <<'(ElementId>)>>)) | Moves the given detail instances one step closer to the front of all other detail instances in the view, while keeping the order of the given ones. |
| BringToFront(Document, View, ElementId) | Places the given detail instance in the front of all other detail instances in the view. |
| BringToFront(Document, View, ICollection<(Of <<'(ElementId>)>>)) | Places the given detail instances in the front of all other detail instances in the view, while keeping the order of the given ones. |
| GetDrawOrderForDetails | Returns the given detail elements according to the currently specified draw order for the detail elements in a given view. |
| IsDetailElement | Indicates if the element is a detail element that participates in detail draw ordering in the view. |
| SendBackward(Document, View, ElementId) | Moves the given detail instance one step closer to the back of all other detail instances in the view. |
| SendBackward(Document, View, ICollection<(Of <<'(ElementId>)>>)) | Moves the given detail instances one step closer to the back with relation to all other detail instances in the view, while keeping the order of the given ones. |
| SendToBack(Document, View, ElementId) | Places the given detail instance behind all detail instances in the view. |
| SendToBack(Document, View, ICollection<(Of <<'(ElementId>)>>)) | Places the given detail instances behind all other detail instances in the view, while keeping the order of the given ones. |

# See Also
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace